{
  "itineraries": [
    {
      "itineraryName": "test",
      "itineraryDetails": {
        "park": {
          "states": "CT,MA",
          "directionsInfo": "For details and directions to the sites within The Last Green Valley, visit, http://thelastgreenvalley.org/.",
          "directionsUrl": "http://thelastgreenvalley.org/contact-us/contact-info/",
          "url": "https://www.nps.gov/qush/index.htm",
          "weatherInfo": "For details and information, please visit, http://thelastgreenvalley.org/.",
          "name": "The Last Green Valley",
          "latLong": "",
          "description": "Discover the beauty of The Last Green Valley National Heritage Corridor!  Spanning 35 towns in northeastern Connecticut and south-central Massachusetts, The Last Green Valley is surprisingly rural and uniquely historic. With 1,100 square miles that are still 77% forests and farms, the pastoral landscape is interspersed with powerful rivers, mill villages, and vibrant town centers.",
          "designation": "National Heritage Corridor",
          "parkCode": "qush",
          "addresses": [
            {
              "postalCode": "06239",
              "city": "Danielson",
              "stateCode": "CT",
              "line1": "203 B Main Street, 2nd Floor",
              "type": "Mailing",
              "line3": "",
              "line2": "P.O. Box 29"
            },
            {
              "postalCode": "06239",
              "city": "Danielson",
              "stateCode": "CT",
              "line1": "203 B Main Street, 2nd Floor",
              "type": "Physical",
              "line3": "",
              "line2": "P.O. Box 29"
            }
          ],
          "id": "95A86C84-F0CB-4493-8B7D-2369D1ED9884",
          "fullName": "The Last Green Valley National Heritage Corridor"
        },
        "eatery": {
          "businessName": "Occidental Grill & Seafood",
          "description": "DC is the country's seat of power -- I know this because I've seen one and a half seasons of House of Cards -- and Occidental is where the power goes out for a rib-eye or scallops. And it's been this way since the beginning, with everyone from Amelia Earhart to multiple presidents dining here. While the original was demolished in the '70s, it deserves a spot on this list because it reopened in the '80s super close to its original location and with its rep intact, as both of the presidents named Bush have since partaken of its steakhouse fare.",
          "state": "DC",
          "city": "Washington",
          "id": 10,
          "ameneties": {
            "wheelchairAccessible": false,
            "petFriendly": false,
            "wifi": false,
            "diaperFacility": true,
            "playground": true,
            "restrooms": true
          }
        },
        "attraction": {
          "id": 4,
          "name": "Snake World",
          "state": "AR",
          "city": "Berryville",
          "description": "The next time you’re in Arkansas, be sure to stop by Snake World! Owner Dale Ertel claims that the tourist attraction houses over 70 snakes, which is even more than the Little Rock Zoo. The reviews on Trip Advisor are all glowing, and warn visitors not to be dissuaded by Snake World’s sketchy exterior.",
          "ameneties": {
            "souvenirs": true,
            "restrooms": true
          }
        }
      },
      "id": 22
    }
  ]
}