{
  "itineraries": [
    {
      "itineraryName": "Really Has Events",
      "itineraryDetails": {
        "park": {
          "states": "LA",
          "directionsInfo": "To reach Oakland Plantation, take I-49 to Exit 127, Flora/Cypress. Head east on LA Highway 120 toward Cypress. Cross over LA Highway 1 onto LA Highway 494. The parking lot and entrance pavilion for Oakland is 4.5 miles east of Highway 1 on the left.\n\nTo reach the grounds of Magnolia Plantation, take I-49 to Exit 119, Derry. Head east on LA Highway 119. Cross over LA Highway 1 and proceed for 1.1 miles. The parking area of Magnolia Plantation is on the right just before the road closure.",
          "directionsUrl": "https://www.nps.gov/cari/planyourvisit/directions.htm",
          "url": "https://www.nps.gov/cari/index.htm",
          "weatherInfo": "Weather in central Louisiana can be unpredictable. Summers are hot and humid. Winter is relatively mild with measurable snowfall every 5-10 years. Average rainfall is approximately 55-60 inches per year. The area is also subject to severe thunderstorms, hail, damaging winds, and tornadoes. Visitors might want to bring hats, umbrellas, and drink plenty of water. Please check the local weather forecast before planning your visit to the park.",
          "name": "Cane River Creole",
          "latLong": "lat:31.65408447, long:-93.00131977",
          "description": "The Cane River region is home to a unique culture; the Creoles. Generations of the same families of owners and workers, enslaved and tenant, lived on these lands for over 200 years. The park tells their stories and preserves the cultural landscape of Oakland and Magnolia Plantations, two of the most intact Creole cotton plantations in the United States.",
          "designation": "National Historical Park",
          "parkCode": "cari",
          "addresses": [
            {
              "postalCode": "71457",
              "city": "Natchitoches",
              "stateCode": "LA",
              "line1": "400 Rapides Dr. (Headquarters)",
              "type": "Mailing",
              "line3": "",
              "line2": ""
            },
            {
              "postalCode": "71457",
              "city": "Natchitoches Parish",
              "stateCode": "LA",
              "line1": "4386 Highway 494, Natchez, LA 71456 (Oakland )",
              "type": "Physical",
              "line3": "",
              "line2": "5549 Highway, 119, Cloutierville, LA  71416 (Magnolia)"
            }
          ],
          "id": "55ABA58B-B19E-4851-BDE1-1C0712B2BE2C",
          "fullName": "Cane River Creole National Historical Park"
        },
        "eatery": {
          "businessName": "Marge's Pancake House",
          "description": "Marge has been making pancakes from her family recipe for 50 years. People love to eat at Marge's Pancake House because everyone who works there dresses as a famous actor every day for work.",
          "state": "IN",
          "city": "Gary",
          "id": 1,
          "ameneties": {
            "wheelchairAccessible": true,
            "petFriendly": false,
            "wifi": true,
            "diaperFacility": false,
            "playground": false,
            "restrooms": true
          }
        },
        "attraction": {
          "id": 8,
          "name": "Owney the Stuffed Dog Postal Mascot",
          "state": "DC",
          "city": "Washington",
          "description": "You can see the unofficial postal system mascot, Owney, at the National Postal Museum where he sits wearing a vest decorated with honors for his travels assisting postal professionals. The little dog died in 1897 but has been displayed at the Post Office Headquarters in Washington, D.C., the St. Louis World’s Fair, and the Smithsonian before arriving at his final resting place, where visitors can see him today.",
          "ameneties": {
            "souvenirs": false,
            "restrooms": false
          }
        }
      },
      "id": 15
    }
  ]
}