{
  "itineraries": [
    {
      "itineraryName": "test",
      "itineraryDetails": [
        {
          "park": {},
          "eatery": {},
          "attraction": {}
        }
      ],
      "id": 1
    },
    {
      "itineraryName": "test2",
      "itineraryDetails": [
        {
          "park": {},
          "eatery": {},
          "attraction": {}
        }
      ],
      "id": 2
    },
    {
      "itineraryName": "test4",
      "itineraryDetails": {
        "park": {
          "states": "CT",
          "directionsInfo": "If you are coming to Weir Farm National Historic Site as part of a group that will require three or more vehicles, please call in advance to arrange a group visit.\n \n-Follow Route 7 the Branchville section of Ridgefield.\n-Turn onto Route 102 West at a traffic light.\n-Take 2nd left onto Old Branchville Road.\n-Turn left at first stop sign onto Nod Hill Road.\n-Follow Nod Hill Road one mile; continue straight after stop sign at Pelham Lane to 735 Nod Hill Road",
          "directionsUrl": "http://www.nps.gov/wefa/planyourvisit/directions.htm",
          "url": "https://www.nps.gov/wefa/index.htm",
          "weatherInfo": "Weir Farm’s grounds are open all year and each season offers a unique experience. For a comfortable visit please note the following information.\nWinter: Temperatures average from 20 F to 40 F.  Storms and colder weather are possible. \nSpring: Temperatures average from 30 F to 70 F.  Rain is common. \nSummer: Temperatures average from 60 F to 85 F.  High humidity is common in July and August. \nFall: Temperatures average from 35 F to 75 F.  Foliage season runs from mid-September to mid-to-late October.",
          "name": "Weir Farm",
          "latLong": "lat:41.25886268, long:-73.45452542",
          "description": "Visit the home and studio of America's most beloved Impressionist, J. Alden Weir, and walk in the footsteps of generations of world-class artists. Set amidst more than 60 acres of painterly woods, fields, and waterways, you’ll soon see why Weir described his home as the \"Great Good Place.\" Weir’s farm is a national legacy to American Impressionism, the creative spirit, and historic preservation.",
          "designation": "National Historic Site",
          "parkCode": "wefa",
          "addresses": [
            {
              "postalCode": "06897",
              "city": "Wilton",
              "stateCode": "CT",
              "line1": "735 Nod Hill Road",
              "type": "Physical",
              "line3": "",
              "line2": ""
            },
            {
              "postalCode": "06897",
              "city": "Wilton",
              "stateCode": "CT",
              "line1": "735 Nod Hill Road",
              "type": "Mailing",
              "line3": "",
              "line2": ""
            }
          ],
          "id": "EA86FED8-2E03-467A-A8BD-4F032A647F35",
          "fullName": "Weir Farm National Historic Site"
        },
        "eatery": {
          "businessName": "Club Paris",
          "description": "In a former funeral parlor built in Downtown Anchorage in the 1920s sits the oldest steakhouse in Alaska ('Home of the 4 inch thick Filet Mignon!'). At this point, it seems somewhat hilarious that the style was originally intended to 'look like a Parisian sidewalk cafe,' but no one is laughing at the very legit steaks (the signature is that 14oz filet, though we like the rib-eye), and, of course, Alaskan king crab legs.",
          "state": "AK",
          "city": "Anchorage",
          "id": "6",
          "ameneties": {
            "wheelchairAccessible": true,
            "petFriendly": true,
            "wifi": true,
            "diaperFacility": true,
            "playground": false,
            "restrooms": true
          }
        },
        "attraction": {
          "id": "3",
          "name": "Big White Shirt",
          "state": "AL",
          "city": "Andalusia",
          "description": "Andalusia, Alabama, is the white dress-shirt capital of America, and this highly photographed enormous white shirt sign is a reminder of that. According to Roadside America, the tie is changed seasonally.",
          "ameneties": {
            "souvenirs": false,
            "restrooms": false
          }
        }
      },
      "id": 3
    }
  ]
}